Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.ToolOptionNames.ObjectsInJoints Field
 The objects in joints.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string ObjectsInJoints = "sel_objects_in_joints"
Public Const ObjectsInJoints As String = "sel_objects_in_joints"
Field Value
Type: String
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace